* PanDas 자료구조

In [29]:
import pandas as pd
import numpy as np
data={'name':['java','수현이','Spring','남이'],
      'year':[2017,2018,2019,2020],
      'points':[1.5,1.7,7.8,4.6]
     }
print(data)

{'name': ['java', '수현이', 'Spring', '남이'], 'year': [2017, 2018, 2019, 2020], 'points': [1.5, 1.7, 7.8, 4.6]}

In [2]:
df=pd.DataFrame(data)

In [3]:
print(df)

     name  year  points
0    java  2017     1.5
1     수현이  2018     1.7
2  Spring  2019     7.8
3      남이  2020     4.6

In [4]:
print(df.values)

[['java' 2017 1.5]
 ['수현이' 2018 1.7]
 ['Spring' 2019 7.8]
 ['남이' 2020 4.6]]

In [5]:
print(df.index)

RangeIndex(start=0, stop=4, step=1)

In [6]:
print(df.columns)

Index(['name', 'year', 'points'], dtype='object')

In [8]:
print(df.shape)

(4, 3)

In [9]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   year    4 non-null      int64
 2   points  4 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 224.0+ bytes
None

In [15]:
dates=pd.date_range('20130101', periods=6)
print(dates)

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [19]:
df=pd.DataFrame() # ----- 대소문자 주의
print(df)

Empty DataFrame
Columns: []
Index: []

In [40]:
df=pd.DataFrame({'A':1.2,
                 'B':pd.Timestamp('20130101'),
                 'C':pd.Series(1, index=list(range(4)), dtype='float32'),
                 'D':np.array([3]*4, dtype='int32'),
                 'E':"PANDAS"
                })
print(df, '\n')
print(df.dtypes)

     A          B    C  D       E
0  1.2 2013-01-01  1.0  3  PANDAS
1  1.2 2013-01-01  1.0  3  PANDAS
2  1.2 2013-01-01  1.0  3  PANDAS
3  1.2 2013-01-01  1.0  3  PANDAS

A           float64
B    datetime64[ns]
C           float32
D             int32
E            object
dtype: object

In [47]:
titanic_df=pd.read_csv('titanic/train.csv')
print('-----'*10)
print(titanic_df)
print('-----'*10)
titanic_df

--------------------------------------------------
     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]
--------------------------------------------------

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [51]:
print('columns = ', titanic_df.columns)

columns =  Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

###### NaN = null

* Survived = 생존여부, 생존=1
* Pclass = 선실등급
* SibSp = 동승 형제자매
* Parch = 동승 직계존속 및 비속 
* Embarked = 탑승장소, S=Southhampton, C=Cherbourg, Q=Queenstown

In [52]:
print('indexs = ', titanic_df.index)

indexs =  RangeIndex(start=0, stop=891, step=1)

In [58]:
# print('indexs = ', titanic_df.index.values)

In [56]:
print(titanic_df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB
None

In [57]:
titanic_df.describe() # ------- std = 표준편차

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

<hr>

* column 기준으로 groupby 하기

In [61]:
value_count_pclass=titanic_df['Pclass'].value_counts()
print(value_count_pclass)

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [63]:
value_count_embarked=titanic_df['Embarked'].value_counts()
print(value_count_embarked)
# Southhampton, Cherbourg, Queenstown

S    644
C    168
Q     77
Name: Embarked, dtype: int64